---
kind: other
id: Methods.T:Autodesk.Revit.DB.SchedulableField
source: html/8c866024-8d20-8446-502c-a06057bf4185.htm
---
# SchedulableField Methods

Determines whether the specified Object is equal to the current Object .